In [18]:
import pandas as pd
from sqlalchemy import create_engine

In [19]:
# Reading in CSVs

Merge_2019 = pd.read_csv("MERGE_2019_df.csv")
Merge_2018 = pd.read_csv("YR2018Data.csv")
Merge_2017 = pd.read_csv("YR2017Data.csv")
Merge_2016_start = pd.read_csv("rdu_2016_data_AD.csv")
Merge_2015_start = pd.read_csv("rdu_2015_data_AD.csv")

L_AIRPORT_ID = pd.read_csv("L_AIRPORT_ID.csv")
L_UNIQUE_CARRIERS = pd.read_csv("L_UNIQUE_CARRIERS.csv")
RDUCurrentDestinations_start = pd.read_csv("RDUCurrentDestinations.csv")
RDUCurrentFlights_start = pd.read_csv("RDUCurrentFlights.csv")
RDU_2015_19_Delays_Causes_ML = pd.read_csv("RDU_2015_19_Delays_Causes_ML.csv")

In [20]:
Merge_2016_start['ORIGIN_AIRPORT_ID']='14492'
Merge_2015_start['ORIGIN_AIRPORT_ID']='14492'
Merge_2015=Merge_2015_start.drop('Unnamed: 0',axis=1)
Merge_2016=Merge_2016_start.drop('Unnamed: 0',axis=1)

In [21]:
# Created merged Dataframe. Use .append() to add each quarter

FINAL_MERGE_df = Merge_2019.append(Merge_2018).append(Merge_2017).append(Merge_2016).append(Merge_2015)

# Display data for the merged data

FINAL_MERGE_df

,ITIN_ID,COUPONS,YEAR,ORIGIN_AIRPORT_ID,QUARTER,ORIGIN,DEST_AIRPORT_ID,DEST,TICKET_CARRIER,OPERATING_CARRIER,REPORTING_CARRIER,PASSENGERS,FARE_CLASS,DISTANCE_GROUP,ITIN_GEO_TYPE,ROUNDTRIP,ITIN_FARE,MILES_FLOWN
0,201917768,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,3.0,Y,2,2.0,1.0,11.0,1064.0
1,201917769,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,1.0,X,2,2.0,1.0,28.0,1064.0
2,201917770,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,1.0,X,2,2.0,1.0,159.0,1064.0
3,201917771,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,2.0,X,2,2.0,1.0,176.0,1064.0
4,201917772,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,3.0,X,2,2.0,1.0,196.0,1064.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
74244,201544973404,2,2015,14492,4,RDU,14100,PHL,AA,ZW,ZW,2.0,X,1,2.0,1.0,550.0,674.0
74245,201544973405,2,2015,14492,4,RDU,14100,PHL,AA,ZW,ZW,1.0,X,1,2.0,1.0,630.0,674.0
74246,201544973406,2,2015,14492,4,RDU,14100,PHL,AA,ZW,ZW,1.0,X,1,2.0,1.0,650.0,674.0
74247,201544973407,2,2015,14492,4,RDU,14100,PHL,AA,ZW,ZW,1.0,X,1,2.0,1.0,670.0,674.0
74248,201544973408,2,2015,14492,4,RDU,14100,PHL,AA,ZW,ZW,1.0,X,1,2.0,1.0,688.0,674.0

In [22]:
RDUCurrentDestinations=RDUCurrentDestinations_start.drop('Unnamed: 0',axis=1)
RDUCurrentFlights=RDUCurrentFlights_start.drop('Unnamed: 0',axis=1)

In [23]:
connection_string = f'postgresql://postgres:Syracuse10!@localhost:5432/where-can-we-go'
engine = create_engine(connection_string)

In [24]:
engine.table_names()

['FINAL_MERGE',
 'L_AIRPORT_ID',
 'L_UNIQUE_CARRIERS',
 'RDUCurrentDestinations',
 'RDUCurrentFlights',
 'RDU_2015_19_Delays_Causes_ML']

In [27]:
FINAL_MERGE_df.to_sql(name='FINAL_MERGE', con=engine, if_exists='replace')
pd.read_sql_query('select * from "FINAL_MERGE"', con=engine).head()

,index,ITIN_ID,COUPONS,YEAR,ORIGIN_AIRPORT_ID,QUARTER,ORIGIN,DEST_AIRPORT_ID,DEST,TICKET_CARRIER,OPERATING_CARRIER,REPORTING_CARRIER,PASSENGERS,FARE_CLASS,DISTANCE_GROUP,ITIN_GEO_TYPE,ROUNDTRIP,ITIN_FARE,MILES_FLOWN
0,0,201917768,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,3.0,Y,2,2.0,1.0,11.0,1064.0
1,1,201917769,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,1.0,X,2,2.0,1.0,28.0,1064.0
2,2,201917770,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,1.0,X,2,2.0,1.0,159.0,1064.0
3,3,201917771,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,2.0,X,2,2.0,1.0,176.0,1064.0
4,4,201917772,2,2019,14492,1,RDU,10529,BDL,DL,9E,9E,3.0,X,2,2.0,1.0,196.0,1064.0

In [29]:
L_AIRPORT_ID.to_sql(name='L_AIRPORT_ID', con=engine, if_exists='replace')
pd.read_sql_query('select * from "L_AIRPORT_ID"', con=engine).head()

   index   Code                                    Description
0      0  10001         Afognak Lake, AK: Afognak Lake Airport
1      1  10003  Granite Mountain, AK: Bear Creek Mining Strip
2      2  10004                       Lik, AK: Lik Mining Camp
3      3  10005         Little Squaw, AK: Little Squaw Airport
4      4  10006                     Kizhuyak, AK: Kizhuyak Bay

In [30]:
L_UNIQUE_CARRIERS.to_sql(name='L_UNIQUE_CARRIERS', con=engine, if_exists='replace')
pd.read_sql_query('select * from "L_UNIQUE_CARRIERS"', con=engine).head()

   index Code                    Description
0      0  02Q                  Titan Airways
1      1  04Q             Tradewind Aviation
2      2  05Q            Comlux Aviation, AG
3      3  06Q  Master Top Linhas Aereas Ltd.
4      4  07Q            Flair Airlines Ltd.

In [31]:
RDUCurrentDestinations.to_sql(name='RDUCurrentDestinations', con=engine, if_exists='replace')
pd.read_sql_query('select * from "RDUCurrentDestinations"', con=engine).head()

,index,DEST_AIRPORT_ID,DEST,DEST_CITY_NAME,DISTANCE,DISTANCE_GROUP,CITY,STATE,LATITUDE,LONGITUDE
0,0,10397,ATL,"Atlanta, GA",356,2,Atlanta,GA,33.748992,-84.390264
1,1,10423,AUS,"Austin, TX",1162,5,Austin,TX,30.271129,-97.743700
2,2,10821,BWI,"Baltimore, MD",255,2,Baltimore,MD,39.290882,-76.610759
3,3,10721,BOS,"Boston, MA",612,3,Boston,MA,42.360253,-71.058291
4,4,11057,CLT,"Charlotte, NC",130,1,Charlotte,NC,35.227209,-80.843083

In [32]:
RDUCurrentFlights.to_sql(name='RDUCurrentFlights', con=engine, if_exists='replace')
pd.read_sql_query('select * from "RDUCurrentFlights"', con=engine).head()

,index,OP_UNIQUE_CARRIER,OP_CARRIER_FL_NUM,DEST_AIRPORT_ID,DEST,DEST_CITY_NAME,DISTANCE,DISTANCE_GROUP
0,0,AA,1786,11057,CLT,"Charlotte, NC",130.0,1
1,1,AA,1794,11057,CLT,"Charlotte, NC",130.0,1
2,2,AA,1805,11057,CLT,"Charlotte, NC",130.0,1
3,3,AA,1818,11057,CLT,"Charlotte, NC",130.0,1
4,4,AA,1912,11057,CLT,"Charlotte, NC",130.0,1

In [33]:
RDU_2015_19_Delays_Causes_ML.to_sql(name='RDU_2015_19_Delays_Causes_ML', con=engine, if_exists='replace')
pd.read_sql_query('select * from "RDU_2015_19_Delays_Causes_ML"', con=engine).head()

,index,YEAR,QUARTER,MONTH,DAY_OF_MONTH,DAY_OF_WEEK,FL_DATE,OP_UNIQUE_CARRIER,OP_CARRIER_FL_NUM,ORIGIN_AIRPORT_ID,...,CRS_ELAPSED_TIME,ACTUAL_ELAPSED_TIME,AIR_TIME,DISTANCE,DISTANCE_GROUP,CARRIER_DELAY,WEATHER_DELAY,NAS_DELAY,SECURITY_DELAY,LATE_AIRCRAFT_DELAY
0,0,2015,1,1,1,4,1/1/15,AA,1302,14492,...,190,188.0,171.0,1061,5,NaN,NaN,NaN,NaN,NaN
1,1,2015,1,1,2,5,1/2/15,AA,1302,14492,...,190,193.0,160.0,1061,5,542.0,0.0,3.0,0.0,343.0
2,2,2015,1,1,3,6,1/3/15,AA,1302,14492,...,190,203.0,167.0,1061,5,1.0,0.0,13.0,0.0,18.0
3,3,2015,1,1,4,7,1/4/15,AA,1302,14492,...,190,212.0,191.0,1061,5,2.0,0.0,22.0,0.0,28.0
4,4,2015,1,1,5,1,1/5/15,AA,1302,14492,...,190,173.0,154.0,1061,5,0.0,0.0,0.0,0.0,42.0

In [34]:
FINAL_MERGE_df.to_csv('FINAL_MERGE_df.csv',index=False)